app/views/tasks/_task.html.erb

SELECT  `users`.* FROM `users` WHERE `users`.`task_id` = 2 ORDER BY `users`.`id` ASC LIMIT 1
---

  <% user = User.where('id = ?', task.user_id).first %>