app/views/tasks/edit.html.erb

SELECT `users`.* FROM `users`
---
              <div class="col-md-10 ml-auto">
                <%= form.collection_select(:user_id, User.all, :id, :first_name, prompt: 'assigned')%>