app/views/projects/show.html.erb

    <div class="col-md-12">
      <% if @project.tasks.count > 0 %>
---
SELECT COUNT(*) FROM `tasks` WHERE `tasks`.`project_id` = 4
SELECT `tasks`.* FROM `tasks` WHERE `tasks`.`project_id` = 1