app/controllers/projects_controller.rb

  def create
    @project = Project.new(project_params)

    respond_to do |format|
      if @project.save
---
INSERT INTO `projects` (`name`, `summary`, `start_date`, `end_date`, `created_at`, `updated_at`) VALUES ('Ruby project', 'TextProject\'s innovative model of text complexity, called Text Elements by Task (abbreviated as TExT), considers the various tasks involved in reading to determine the complexity or difficulty of specific texts. In addition to rating existing texts, the TExT model is used to create texts designed to help beginning and struggling readers master the tasks necessary for reading success.', '2018-06-25', '2018-06-30', '2018-06-25 13:46:34', '2018-06-25 13:46:34')

  def update
    respond_to do |format|
      if @project.update(project_params)
---
UPDATE `projects` SET `summary` = 'faewsagw', `updated_at` = '2018-06-26 13:12:54' WHERE `projects`.`id` = 2

  def destroy
    @project.destroy
---
DELETE FROM `projects` WHERE `projects`.`id` = 1

    def set_project
      begin
        @project = Project.find(params[:id])
---
SELECT  `projects`.* FROM `projects` WHERE `projects`.`id` = 1 LIMIT 1