app/controllers/tasks_controller.rb

SELECT  `tasks`.* FROM `tasks` WHERE `tasks`.`id` = 2 LIMIT 1
---
  def edit
    begin
      @task = Task.find(params[:id])

INSERT INTO `tasks` (`title`, `description`, `project_id`, `created_at`, `updated_at`, `status`) VALUES ('Fix bag', 'Error Fix works to fine-tune your system performance by checking for Registry errors, but the word \"fix\" is a misnomer in this strict trial version.', 1, '2018-06-25 18:49:41', '2018-06-25 18:49:41', 'new')
---
  def create
    @task = @project.tasks.create(task_params)

SELECT  `tasks`.* FROM `tasks` WHERE `tasks`.`project_id` = 1 AND `tasks`.`id` = 1 LIMIT 1
DELETE FROM `tasks` WHERE `tasks`.`id` = 1
---
  def destroy
    @task = @project.tasks.find(params[:id])
    @task.destroy

SELECT  `tasks`.* FROM `tasks` WHERE `tasks`.`id` = 6 LIMIT 1
UPDATE `tasks` SET `status` = 'in progress', `user_id` = 3, `updated_at` = '2018-06-26 17:35:06' WHERE `tasks`.`id` = 11
---
  def update
    @task = Task.find(params[:id])

    respond_to do |format|
      if @task.update_attributes(task_params)

SELECT  `projects`.* FROM `projects` WHERE `projects`.`id` = NULL LIMIT 1
---
  def set_task
    begin
      @project = Project.find(params[:project_id])